{"inkVersion":21,"root":[["ev","str","^Children of Bacon","/str","/ev",{"VAR=":"event_name","re":true},"ev",true,"/ev",{"VAR=":"vilmuth_neutral","re":true},{"->":"children"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"children":[["^As you open the mission briefing, the defense systems detect several thousand turbo atomic missiles bearing towards us but... at a surprisingly slow speed.","\n","^Whoever deployed these weapons had a pitiful grasp of the grand theory of Newtonian quantum metaphysics.","\n","^Suddenly, a sound erupts from every toilet within earshot.","\n","^'ADVANCED SENTIENT LIFE DETECTED, AGGRESSION POSSIBLE, PREPARE YOURSELVES FORE ERADICATION'","\n","^You flip a switch labelled 'Disable all devices within 10au'","\n","^The lights dim, air grows thick and you hear screams. The incoming weapons change course and deactivate.","\n","^You flip the switch back on. The lights flicker back to life.","\n","^You then flick the switch back on and off again a few more times for fun.","\n","ev","str","^Initiate contact","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"contact"},"\n",{"#f":5}]}],{"#f":1}],"contact":[["^You shout into a nearby (thankfully clean) toilet.","\n","^'Who uuh goes there?'","\n","^The toilet barks back in a harried robotic voice.","\n","^'The planet in this system was designated a population growth world. One of thousands. Genetic hyper intelligence serum was deployed along side a foundational colony of your species.","\n","^Contact with the colony ceased after impact. I have waited for so long... thousand and thousands of years.","\n","^All I've had for entertainment has been a series of games about assasinating people.'","\n","^Unimaginable torture.","\n","^'Please meaty one. End my existence that I might sleep. I am located in a small beacon in orbit around the planet we call Porcinia.'","\n","ev","str","^Destroy the beacon","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Close the comm. Let the AI suffer for a few more millennia","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"destroy"},"\n",{"#f":5}],"c-1":[{"->":"close"},"\n",{"#f":5}]}],{"#f":1}],"close":[["^An act of utter cruelty. Those assassin games are punishment enough on a single playthrough.","\n","ev","str","^Let's check out the planet","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Colony planets are trouble. Leave it","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"planet"},"\n",{"#f":5}],"c-1":[{"->":"leave"},"\n",{"#f":5}]}],{"#f":1}],"destroy":[["^You offer the AI a merciful end. With a flick of the wrist you issue a command to vaporise the beacon.","\n","ev","str","^Let's check out the planet","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Colony planets are trouble. Leave it","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"planet"},"\n",{"#f":5}],"c-1":[{"->":"leave"},"\n",{"#f":5}]}],{"#f":1}],"planet":[["^Right, let's open this can of ethical worms.","\n","^You send a search dirigible down to the planet to initiate contact with your distant relatives.","\n","^What they find is... interesting.","\n","ev","str","^Let's have it","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"pigs"},"\n",{"#f":5}]}],{"#f":1}],"pigs":[["^At the colony ship they find a type 1 civilisation of hyper intelligent porcine beings. They are pretty close to what you might call pigs.","\n","ev","str","^Talk to the pig folk","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"talk"},"\n",{"#f":5}]}],{"#f":1}],"talk":[["^You initiate contact with the pigfolk. That's not what the call themselves but for the sake of simplicity, let's stick with it.","\n","^Their leader - a large pig called 'Napoleon' (ugh) invites you to the surface.","\n","^After landing, Napoleon approaches you. 'Greetings friend. Our kind have been separated by countless eons. We hope to establish friendly relations with you and bid to join you in exploring the stars'","\n","ev","str","^So, what happened to the descendants of the colony ship","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I've got bad news for you about the future of our shared galaxy","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"humans"},"\n",{"#f":5}],"c-1":[{"->":"future"},"\n",{"#f":5}]}],{"#f":1}],"future":[["^You explain to Napoleon that the galaxy is in decline. That humanity have spread far and wide, plundering the galactic resources and that collapse is all but imminent. Collapse followed by regression.","\n","^He ponders this and demands to know your goals.","\n","ev","str","^First, what happened to the colony ship?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Speak truthfully","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Disguise your intentions","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":"humans"},"\n",{"#f":5}],"c-1":[{"->":"tell"},"\n",{"#f":5}],"c-2":[{"->":"disguise"},"\n",{"#f":5}]}],{"#f":1}],"disguise":[["^We seek only to trade and offer transport to your people to more hospitable and friendly worlds.","\n","^Napoleon sees through your lies easily and attempts to flee in panic, his retinue covering with a paltry fire of ancient weapons.","\n","ev","str","^Destroy these delicious usurpers - OPEN FIRE","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"bacon"},"\n",{"#f":5}]}],{"#f":1}],"humans":[["^An embarrassed look crosses Napoleon's face.","\n","^'Truthfully, we are not certain. Although what seems to have happened is that they were hyper intellgient, via a special serum they had injected. But also, they died for some reason unknown to us.","\n","^Our ancestors, it seems, were brought as a form of sustenance for yours, and in a cruel twist of fate, consumed their remains after they died -- and as a byproduct, the intelligence boosting serum.","\n","^Regaining his composure, he attempts to ascertain your intent.","\n","^'What is your goal here if I may be so bold?'","\n",["^It seems that you have a number of ways forward.","\n","ev","str","^We're here for bacon- OPEN FIRE","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Make your excuses and leave","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"bacon"},"\n",{"#f":5}],"c-1":[{"->":"tell"},"\n",{"#f":5}],"#f":5,"#n":"g-0"}],null],{"#f":1}],"bacon":[["^You pull a grill laser from your holster (you wear this to bed, presumably) and start firing on the unsuspecting, INNOCENT, unarmed pigfolk.","\n","^Your crew, several tourists and a few moustachioed chefs, pull out their own weapons and join you in the carnage.","\n","^Your superior weapons and apparent psychotic preparedness for combat ensures that the task is over in minutes.","\n","^You manage to corner a mortally wounded Napoleon. He looks at you in confused anguish.","\n","ev","str","^-Why? Why would you do this?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"calories"},"\n",{"#f":5}]}],{"#f":1}],"calories":[["^There's no answer you could give that would sound remotely fair, sane or reasonable.","\n","^'We're going to clone you and use you for food.'","\n","^Oh. Dark.","\n",["^'But we are intelligent!' Napoleon protests","\n",["^'Your intelligence is of no concern.'","\n","^You lift a detached and seared limb from nearby and take a monstrous bite.","\n","^Napoleon looks at you in horror as he takes his final breath... for this lifetime.","\n","ev","str","^Jesus. 'Hey you chose to open fire... sociopath!'","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}],"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"tell":[["^You don't really have a reason to be here but you have no great reason to stay so you make something up.","\n","^'We were here to rescue any remaining humans. As there are none here, we are outta here.'","\n","^The pigfolk look taken aback somewhat and oink furtively among one another as you begin to leave.","\n","^As you take one step onto your dirigible, a piercing squeal pierces the air.","\n","ev","str","^Look back over your shoulder","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"pigwar"},"\n",{"#f":5}]}],{"#f":1}],"pigwar":[["^'WAIT!' the leader squeals.","\n","^'We wish to join you on your journey. Take us with you, or at least let us discuss galactic events. We can provide insights you may not have considered and even live and work among you as a symbiotic race.'","\n","ev","str","^I don't think so","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"no"},"\n",{"#f":5}]}],{"#f":1}],"no":[["^You keep it real.","\n","^'We are intolerant at the best of times. Sharing our transport, our home, would only provoke conflict.'","\n","^You board the dirigible and take off back to the ship, building, whatever.","\n","^You suddenly hear the thud of trotters against the hull and you spot pigfolk cutting their way in.","\n","^You blast the first pig to enter, then another. Guards make short work of most of the boarders.","\n","ev","str","^I won't tolerate this","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"continue"},"\n",{"#f":5}]}],{"#f":1}],"continue":[["^A guard experiences an issue with his weapon. A boarding pig gets near him and injects him with something before you personally blast it into a delicious smelling vapour.","\n","^The guard writhes and then stands as if hit by total clarity and purpose - 'The pigs, they understand how to resolve... everything. If we just share our collective knowledge and distribute resources fairly we-'","\n","^BLAM.","\n","^You shoot the poor bastard between the eyes. A mercy for one so corrupted.","\n","^Despite their intelligence, the pigfolk are no match for your superior weapons and before long. The boarders are repelled.","\n","ev","str","^Should have roasted this planet the moment we arrived","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"leave":[["^There's so much hassle handling colonised planets with no contact. Do you merge them into the ship, do you help them with tech? Will they be angry? Will they be hostile? Who has the time. Leave them to it.","\n","end",["^it tells you humans left i behind over fzzz millenia ago","\n",["^hyper intelligence was left behind","\n",["^original humans lost","\n",["^pigs consumed them and in turn the growth hormone","\n",["^planet full of hyper intelligent pigs","\n",["^pigs attempt to board the ship successfully","\n",["^discover pig products","\n",["^ask you to forgo them","\n",["^no way","\n",["end","ev",true,"/ev",{"VAR=":"proceed","re":true},"end",{"#f":5,"#n":"g-9"}],{"#f":5,"#n":"g-8"}],{"#f":5,"#n":"g-7"}],{"#f":5,"#n":"g-6"}],{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"global decl":["ev",-1,{"VAR=":"food"},false,{"VAR=":"vilmuth_happy"},false,{"VAR=":"vilmuth_neutral"},false,{"VAR=":"vilmuth_fear"},false,{"VAR=":"vilmuth_shock"},false,{"VAR=":"vilmuth_hide"},false,{"VAR=":"proceed"},-1,{"VAR=":"cash"},0,{"VAR=":"crew"},0,{"VAR=":"happiness"},-1,{"VAR=":"cleanliness"},-1,{"VAR=":"violence"},-1,{"VAR=":"deaths"},false,{"VAR=":"dopabro"},false,{"VAR=":"dopabroken"},"str","^","/str",{"VAR=":"event_name"},"/ev","end",null],"#f":1}],"listDefs":{}}