{"inkVersion":21,"root":[["ev","str","^Ex-Mult","/str","/ev",{"VAR=":"event_name","re":true},{"->":"multiverse"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"multiverse":[["ev",true,"/ev",{"VAR=":"vilmuth_shock","re":true},"^'Lord, we have a hail. It appears to be ourselves from some other wayward universe. It’s always someone worse off sire, good universes leave other universes alone, and only weak universes pester their betters'","\n","ev","str","^Ignore hail","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Take the call","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Have the boys use the parallel-universe cannon","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":"ignore"},"\n",{"#f":5}],"c-1":[{"->":"yello"},"\n",{"#f":5}],"c-2":[{"->":"nukem"},"\n",{"#f":5}]}],{"#f":1}],"yello":[["^You decide to answer the call and an image of yourself wearing a thong, a sweater with vilmuth's face on it and a pair of oven mitts appears on screen.","\n","^It's also just as you expected. A nightmare universe: full of snakes, drinking the water is painful but they all have to drink every few seconds, and their moon has haunted their ship.","\n","^Alternate-you speaks:","\n","^'Bonjour, nous avons remarqué que vous vous êtes approché trop près d'une de nos poches arrière interdimensionnelles. S'il vous plaît, ne nous parlez pas avec votre sale langage parallèle, prenez ces canards en caoutchouc et allez vous faire foutre. Aéroglisseur.'","\n","^Great, not only do they look insane, they're talking in some kind of insane-sounding ancient language.","\n","ev","str","^End this call immediately!","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Try to establish some form of communication","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"ignore"},"\n",{"#f":5}],"c-1":[{"->":"answer"},"\n",{"#f":5}]}],{"#f":1}],"ignore":[["^We don't have the time and resources to play hero to every dying universe, charity begins in your home universe.","\n","^Apparently, your choice to ignore the call was exactly what this parallel universe needed as they immediately teleport a vast quantity of ducks into your cargo hold.","\n","^On the viewing screen, you see a whale pop into view, the whale turns into a couch, then a slice of lemon, then a brick, then the concept of a world sat on the back of elephants, then general anxiety.","\n","^A small fart is heard by everyone within their own skulls and at that, the interaction appears to be complete.","\n","ev","str","^Get me back to the central finite curve","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"nukem":[["^'We're well-equipped to deal with such quarrelsome lesser universes lord. We'll wipe these bastards out of every conceivable dimension.'","\n","^Vilmuth nods at a comm relay and several engineers scuttle into the room lugging cables and various devices with them. A large red button is placed before you.","\n","ev","str","^Smack it with satisfying spin and THWACK","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Is it wise to eradicate an entire universe? Seems a little overkill for a nuisance call. Call it off.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"thwack"},"\n",{"#f":5}],"c-1":["^ ",{"->":"nah"},"\n",{"#f":5}]}],{"#f":1}],"nah":[["^You decide not to uni-genocide an entire universe. That would really be a big ethical no-no in most circles. A faux pas at least. Gauche perhaps.","\n","^The engineers seem disappointed.","\n","ev","str","^Answer the hail","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Make your excuses","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"answer"},"\n",{"#f":5}],"c-1":[{"->":"excuses"},"\n",{"#f":5}]}],{"#f":1}],"excuses":["^You might not be a killer but it's not your job to go around giving handouts to every universe suffering from existential threats.","\n","^You opt to hang up and think no more of it. In fact, let's have the crew clean the deck as a treat.","\n","end",{"#f":1}],"answer":["^You try to communicate by throwing your shoe at the screen, screaming nonsense and thrusting at your comm console. Nothing.","\n","^Finally, you feel obligated to offer the void traveller's food.","\n","^This is apparently an interdimensional faux-pas, your act of kindness enrages them and they open fire on you.","\n","^Fortunately, their weapons work by launching themselves as ammunition. This is why we don't mess with other dimensions as a standard.","\n","^Have some goons clean the windows and foist a lie about spontaneous orbital meat clouds onto the crew and hope they don't ever see a copy of their own half-liquified face.","\n","^What an afternoon. ","end","\n",{"#f":1}],"thwack":[["^The air around you sizzles and you experience a hallucinatory flash of events. A history of all things, emotions, permutations of matter and being hyper-compressed to an instant. It leaves a taste of chocolate marmite marshmallow and existential chilli tuna sandwiches on your tongue. Not bad.","\n","ev","str","^Well, are they... gone?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"gone"},"\n",{"#f":5}]}],{"#f":1}],"gone":[["^An engineer is pushed forwards to reply.","\n","^He rubs his neck anxiously.","\n","^'Well, sir it’s like this. We haven’t really used the PUC before and it seems we might have overdone it a touch.’","\n","ev","str","^Overdone it?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"overdone"},"\n",{"#f":5}]}],{"#f":1}],"overdone":["^'We may have wiped them all out sir. [AHEM] All of 'em. All of the parallel universes in the entire multiverse.'","\n","^You ponder as the scapegoat squirms, fearful of retribution.","\n","^'Very good lad. We are all fine and we can't know for sure that we've just eradicated unfathomable near-infinities of lives. All we’ve done is increase the weight and grounded nature of our own existence. Seems like a win-win for me. Vilmuth, promote this fellow at once.'","\n","^Everyone feels a little better. Multiverses are so tedious anyway. ","end","\n",{"#f":1}],"getName":["ev","str","^The dreaded error method! What a truly horrifying name","/str","/ev","~ret",{"#f":1}],"global decl":["ev",false,{"VAR=":"vilmuth_happy"},false,{"VAR=":"vilmuth_neutral"},false,{"VAR=":"vilmuth_fear"},false,{"VAR=":"vilmuth_shock"},false,{"VAR=":"proceed"},"str","^testShipName","/str",{"VAR=":"shipName"},"str","^","/str",{"VAR=":"event_name"},"/ev","end",null],"#f":1}],"listDefs":{}}