{"inkVersion":21,"root":[[{"->":"Relic"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Relic":[["^Lord an artifact of note is floating dormant in this system. It appears to be a relic of technology, it’s unclear wether it is of our own species creation or antoher’s and frankly, the risk of danger, death and contamination is the same either way. What do you suggest we do with it?","\n","ev",true,"/ev",{"VAR=":"vilmuth_neutral","re":true},"ev",true,"/ev",{"VAR=":"vilmuth_food","re":true},"ev","str","^We can't risk such filth. Destroy it.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Let's a have a jolly good look at it","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"destroy"},"\n",{"#f":5}],"c-1":["^ ",{"->":"look"},"\n",{"#f":5}]}],{"#f":1}],"destroy":[["^Very good captain. I will demand the crew enact strict decontaminatory protocols during processing.","\n","ev","str","^Protocols?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"protocols"},"\n",{"#f":5}]}],{"#f":1}],"protocols":["ev",true,"/ev",{"VAR=":"vilmuth_neutral","re":true},"^Blow it up. We're going to blow it up.","\n","^Vilmuth taps a series of buttons into his comm link. You pull up a screen and watch as a small dot explodes with the force of 10 Tsar bombas, filling the screen with white pixels. ","end","\n",{"#f":1}],"look":[["^You have the object brought aboard and within minutes, half the crew are insensate - friends biting one another, enemies making out, cats and dogs living together, mass hysteria.","\n","^Your sealed chamber seems to protect you and a few goons from the effects. What's the plan?","\n","ev","str","^Hope this all blows over.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Have some of your specialists destroy the relic.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Ascertain its goals","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":"winchester"},"\n",{"#f":5}],"c-1":[{"->":"violent"},"\n",{"#f":5}],"c-2":[{"->":"goals"},"\n",{"#f":5}]}],{"#f":1}],"winchester":["ev",true,"/ev",{"VAR=":"vilmuth_hide","re":true},"^'There's no way we're destroying a class 2 relic.' you exclaim.","\n","^'Seal the bulkheads and spray the crew with a a nutrient paste for a few weeks. Let's see if it cools off.'","\n","^It does cool off. After some bruised egos, unexpected marriages and high vet bills, you are able to sell the relic to a passing warmonger who can make better use of it.","\n","^food = -20","\n","^cash = 100","\n","end",{"#f":1}],"violent":["ev",true,"/ev",{"VAR=":"vilmuth_hide","re":true},"^An assault team is prepped and after some emotionally turbulent poetry readings, they finally snap out of it vaporise the relic. The entire ship feels the effect immediately. It's a relief for some and a climactic denial for others.","\n","^Everyone is glad not to controlled by some kind of cursed artifact though which is nice.","\n","^violence = -20","\n","end",{"#f":1}],"goals":[["ev",true,"/ev",{"VAR=":"vilmuth_hide","re":true},"^You attempt to communicate with the relic using a voice relay.","\n","ev","str","^Dear uhh... object. What is your purpose? What do you require?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"require"},"\n",{"#f":5}]}],{"#f":1}],"require":[["^To your immediate surprise, the device levitates and forces the entire crew to respond in an eerie chorus.","\n","^'This Dopabro emotional resonance battery's 500000 day free trial period has expired. Please either purchase a license or remove it from your cargo hold'","\n","ev","str","^I wish to purchase a license","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^IGNORE","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Try to mess with the regex","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":"purchase"},"\n",{"#f":5}],"c-1":[{"->":"ignore"},"\n",{"#f":5}],"c-2":[{"->":"regex"},"\n",{"#f":5}]}],{"#f":1}],"getName":["ev","str","^The dreaded error method! What a truly horrifying name","/str","/ev","~ret",{"#f":1}],"purchase":[["^The device and crew gleefully chirp up again,","\n","^'An annual galactic license for this unit can be automatically deducted from your immediate vicinity. The cost is 100m living souls. Confirm?'","\n","ev","str","^*sigh* Confirm","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"confirm"},"\n",{"#f":5}]}],{"#f":1}],"confirm":["^Suddenly the device blinks out of existence. 100 million crew members, mostly the good looking ones (classic) vanish along with it. This is going to really mess with the economy. You notice that a new Dopabro booth has appeared within the ship.","\n","ev",true,"/ev",{"VAR=":"dopabro","re":true},"end",{"#f":1}],"ignore":["^You decide to ignore the device as it angrily repeats its demands at you, insisting mildly that you should pay.","\n","^Sure the crew are considerably less predictable but are humans ever really predictable?","\n","^After some time, the device vanishes but its effects linger considerably.","\n","ev",15,"/ev",{"VAR=":"violence","re":true},"end",{"#f":1}],"regex":["^You have some technerds try to tinker with the device to enable its effects without paying. This appears to enrage it somewhat but your people are nothing if not persistent.","\n","^You gain access to a Dopabro booth although it seems to be somewhat unreliable.","\n","ev",true,"/ev",{"VAR=":"dopabroken","re":true},"ev",true,"/ev",{"VAR=":"proceed","re":true},"end",{"#f":1}],"global decl":["ev",false,{"VAR=":"vilmuth_food"},false,{"VAR=":"vilmuth_happy"},false,{"VAR=":"vilmuth_neutral"},false,{"VAR=":"vilmuth_fear"},false,{"VAR=":"vilmuth_shock"},false,{"VAR=":"vilmuth_hide"},false,{"VAR=":"proceed"},-1,{"VAR=":"cash"},-1,{"VAR=":"cleanliness"},-1,{"VAR=":"violence"},-1,{"VAR=":"deaths"},-1,{"VAR=":"dopabro"},-1,{"VAR=":"dopabroken"},"/ev","end",null],"#f":1}],"listDefs":{}}