{"inkVersion":21,"root":[[{"->":"blind"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"blind":[["ev",true,"/ev",{"VAR=":"vilmuth_shock","re":true},"^A series of derelicts litter the edge of the system. No life signs. A broadcast emanates from within one cluster.","\n","^An entity calling itself inkblot makes several attempts at conversation but it's like conversing with a browser extension that offers facts about cats.","\n","^'Want to browse without hassle? Try NordicSurfSpaceShark and baste your traffic with the finest antifreeze for only seven installments of eleventy nine fifty five.'","\n","ev","str","^Address inkblot","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"address"},{"#f":5}]}],{"#f":1}],"address":[["^'Unknown intelligence. Submit all advertising data, weapons, personally identifiable information, foodstuffs and valuables to us at once.'","\n","^It responds with an eerily guttural voice:","\n",["^'What are you buying? There are over seventeen mirrors in the mirror world. Get your tanks off my lawn Jeremy.'","\n","ev","str","^Berate inkblot angrily","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Answer honestly","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"berate"},"\n",{"#f":5}],"c-1":[{"->":"honest"},"\n",{"#f":5}],"#f":5,"#n":"g-0"}],null],{"#f":1}],"berate":[["ev",true,"/ev",{"VAR=":"vilmuth_neutral","re":true},"^You mock the voice mercilessly in a tirade that leaves you sweating and breathless. Several nearby people are visibly shaking, others vomiting.","\n","^The voice pauses for a moment before responding with total ignorance.","\n",["^'I declare bankruptcy! Blood alone moves the wheels of history. My hovercraft is full of eels.'","\n","ev","str","^We need to find out what is going on here","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Initiate bombardment","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^   ",{"->":"investigate"},"\n",{"#f":5}],"c-1":[{"->":"bombs"},"\n",{"#f":5}],"#f":5,"#n":"g-0"}],null],{"#f":1}],"honest":[["^'I am in the market for a new summer bow tie.","\n","^Now that I have answered your questions. Tell me, what is your purpose and credit score?'","\n","^It replies:'My favourite animal is the kakapo, I once saw one in Sweden. Potatoes potatoes potatoes. You've got to be poor to eat potatoes. Really poor.'","\n","ev","str","^Initiate bombardment","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"bombs"},"\n",{"#f":5}]}],{"#f":1}],"bombs":[["^You initiate a bombardment that ignites the entire 'fleet' if it can be called that. Several small vessels take flight into the abyss.","\n","^Guess you'll never know what the this place truly was.","\n","^I love a good orbital bombardment as much as the next person but it may be prudent to consider solving some situations with more composure.","\n","ev","str","^Hey I'm in charge","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Consider the advice","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"impudence"},"\n",{"#f":5}],"c-1":[{"->":"consider"},"\n",{"#f":5}]}],{"#f":1}],"impudence":[["^'If I want to scour every planet in every system we jump to, I will do just that. Rightfully, wrongly, it doesn't matter. I decide. I make the decisions. I hold the keys. I am running the show.'","\n","^Sure. You're the boss. Just don't expect the most interesting scenarios when you're running it all 'murder hobo'","\n","ev","str","^Bomb this dialogue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"consider":[["^'I have often thought of the voices silenced and the lives ended or otherwise ruined by my actions.","\n","^Perhaps I go to far in my sudden and immediate ending of billions of lives and property?'","\n","^Thanks for considering that minute possibility.","\n","ev","str","^No. It's the universe that is wrong","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"investigate":[["^You send a thousand drones to board a nearby space hulk.","\n","^Each labyrinthine room is reportedly some form of trap or alien mockery of existence.","\n","^One room violently expels radiation in all directions anytime someone blinks.","\n","^Another fills rapidly with kittens until all occupants are smothered.","\n","^For clarity, by drones, I meant paid workers.","\n","^One room possesses minds, projecting a virtual life into hundreds of brains. Joyful, meaningful lives full of acceptance, love and respect. Decades of blissful summer days, warmed with the wealth of the victim's wildest dreams.","\n","^Then, it is torn away. Visions of burning loved ones, homes filled with blood. All-pervading clouds of pain. Endless torment repeated for unknown imperceptible eternities.","\n","^Those killed by kitten suddenly seem quite lucky.","\n","ev","str","^So it's a nightmare maze made by sadist aliens?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"nightmare"},"\n",{"#f":5}]}],{"#f":1}],"nightmare":[["^It's not only a nightmare. We managed to capture a number of large crablike creatures populating the vessels.","\n","^They seem to be devoid of sentience but are highly capable of murdering anything and everything in their immediate vicinity with their pincers.","\n","^Convergent evolution loves a crab.","\n","ev","str","^Consider the lobster","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"lobster"},"\n",{"#f":5}]}],{"#f":1}],"lobster":[["^You circle a cage with a snarling, hissing clawed crustacean.","\n","^It tries to read you. It clearly seeks to use our weaknesses and psychoses against us with psychic chicanery. Classic.","\n","^This cage is fitted with anti-chicanery technology. The hard-shelled creature recieve a jolt of electricity for its efforts.","\n","^You chuckle and kick the cage, startling the impulsive creature.","\n","^'It's afraid.'","\n","ev","str","^Let's keep him","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Let's add it to the menu","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Wipe them out. All of them","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":[{"->":"keep"},"\n",{"#f":5}],"c-1":[{"->":"menu"},"\n",{"#f":5}],"c-2":[{"->":"bombs"},"\n",{"#f":5}]}],{"#f":1}],"keep":["^You will keep this... thing. In a public spot for people to jeer at. You may even introduce it into the fighting pits for some mild entertainment.","\n","end",{"#f":1}],"menu":["^Pan fried, deep fried, stir-fried. Space-pineapple shrimp, asteroidal lemon shrimp, imitation coconut shrimp, pepper shrimp, shrimp soup, galactic shrimp stew, shrimp salad, shrimp and potatoes, shrimp burger, shrimp sandwich. That- that's about it.","\n","end",{"#f":1}],"getName":["ev","str","^The dreaded error method! What a truly horrifying name","/str","/ev","~ret",{"#f":1}],"global decl":["ev",false,{"VAR=":"vilmuth_happy"},false,{"VAR=":"vilmuth_neutral"},false,{"VAR=":"vilmuth_fear"},false,{"VAR=":"vilmuth_shock"},false,{"VAR=":"proceed"},"str","^testShipName","/str",{"VAR=":"shipName"},"/ev","end",null],"#f":1}],"listDefs":{}}