{"inkVersion":21,"root":[["ev","str","^The Deviant","/str","/ev",{"VAR=":"event_name","re":true},{"->":"disbelief"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"disbelief":[["ev",true,"/ev",{"VAR=":"vilmuth_shock","re":true},"^A man is dragged kicking and screaming into your chambers. The guards toss him down and ensure that the bedraggled fiend cannot escape or draw close to you.","\n","ev","str","^What is the meaning of this?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"explain"},"\n",{"#f":5}]}],{"#f":1}],"explain":[["^A guard the size of an airport steps forward sheepishly, which is a bizarre sight to itself.","\n","^Apologies for bothering you with such a triviliality my liege but this loathsome wretch has been caught…. tainting various objects, not to mention at least a year’s worth of soft furnishings and food supplies!","\n","ev","str","^How does this affect me?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Tainted?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"mememe"},"\n",{"#f":5}],"c-1":[{"->":"tainted"},"\n",{"#f":5}]}],{"#f":1}],"mememe":[["^The giant cows guiltily.","\n","^'Of course, this is beneath your remit sire but it’s come to our attention that this little tossbag has violated some of your own..... personal effects.'","\n","ev","str","^VIOLATED?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"tainted"},"\n",{"#f":5}]}],{"#f":1}],"tainted":[["^How exactly has he tainted things?","\n","^The guard summons the words, fighting back a revulsion reserved for finding body parts in your cereal.","\n","^'We don’t know the specifics sir but it’s believed he uhh… copulated with your pillow. Well, all of your pillows.... and your toothbrush.... toiletries, several breakfast items and potentially.. your gloves.","\n","ev","str","^...WHAT?!","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"reply"},"\n",{"#f":5}]}],{"#f":1}],"reply":[["^You stand, ready to command this miscreant to a life of scraping the rust from the engines using his teeth.","\n",["^The man squeals in protest.","\n","^'I didn't, I didn't it was not me sir!'","\n","^BIFF","\n","^The guard delivers a rib-crunching blow to the man’s solar plexus.","\n","ev","str","^Hear him out","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Feed him to the mosquitos on the entomology deck","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Feed him to the giant mosquitos on the etymology deck","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^-",{"->":"hear1"},"\n",{"#f":5}],"c-1":[{"->":"kill"},"\n",{"#f":5}],"c-2":[{"->":"kill2"},"\n",{"#f":5}],"#f":5,"#n":"g-0"}],null],{"#f":1}],"kill":[["^The man screams in despair, he hates needles, bugs and dying. We won't understand his reasoning or the truth of what happened.","\n","^But really, who even cares?","\n","^Wrap this one up in a neat little bow. Justice has been served.","\n","ev","str","^I am going to need a new pair of gloves.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"kill2":[["^The man howls with agonised dread. He hates being lectured to, learning and the history of words and their meanings. Truly a fate worse than death, those mosquitos will suck every drop of attention in this man's body until he is nought but a husk.","\n","^Don't bang other people's pillows man, a lesson for us all.","\n","ev","str","^I need to install auto-kill weapons in my room","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"kill3":[["^Having heard a trillion stories from professional con artists, liars, bastards, thieves and people who need 3 credits because their aunt is sick and they need a fare to get to the hospital but their leg is hurt and their comms are down - you know when you are being spun a line.","\n","^'ENOUGH.' you bark.","\n","^'Guards for the love of ancient gaia would you please just take this walking sack of rancid fat and execute him?'","\n","^The guards nod, somewhat ashamedly and immediately knock him out with a merciless thus of a compliance stick to the cranium. They drag the man away.","\n","^You hear a distant boom and decide to lock the doors and carry on with more important work.","\n","ev","str","^Let's gamble or people watch!","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"hear1":[["^You hold up a hand to prevent the guard from tearing the man in half.","\n","^'Okay citizen, explain yourself'","\n","^Ignoring the pain of fractured bone at the opportunity of reprieve, the man begins to sputter his reply,","\n",["^'I was enthralled by an entity other than myself. It compelled me to act in such a way that I was unable to resist! Please sire, I wouldn't do this! I am a simple streamer and I focus on good wholesome cozy sims, I would never do this! How else could I even have gotten the access level needed to enter your domain?'","\n","ev","str","^I don't believe him. Kill him","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hmm","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"kill3"},"\n",{"#f":5}],"c-1":[{"->":"hear2"},"\n",{"#f":5}],"#f":5,"#n":"g-0"}],null],{"#f":1}],"hear2":[["^The guard smacks the man to the ground with a backhand to the face.","\n","^'My lord! The fool even boasted about this on his stream'","\n","^The guard proffers you a device and sure enough, a clip surfaces of the man boasting about ransacking his dignity all over your life-preserving eternity treatments at your victual station.","\n","^'My words were not my own! In fact that is not even me but a genetically identical clone. At that timestamp, I was dutifully feeding my grandmother's man-eating toads. You can verify her visitation logs at the prison deck!'","\n","ev","str","^Verify and validate","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Bullshit. Unalive this dolt","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"hear3"},"\n",{"#f":5}],"c-1":[{"->":"kill3"},"\n",{"#f":5}]}],{"#f":1}],"hear3":[["^The guards display a valid visitation log but upon checking the video feeds from the timestamp, a person who is clearly not this man is seen handing over the documents to the prison staff.","\n","^'Can you explain why the person in the video at the prison has no arms while you clearly have 2?'","\n","^The man sweats golfball-sized droplets onto the deck.","\n","^'Well of course the video was edited by the same person who cloned and psychically manipulated me. In fact, I theorise that there is a cabal of insidious beings who threaten to remove you from the control throne and use underlings like me to mock you! Yes, that must be it, an upper-echelon society of bitter psychics who can't be seen and who clone and use regular folk and I bet they are xenoid affiliated and using xenoid tech!","\n","ev","str","^I think I have heard enough. End him","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Consider his claims carefully","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":[{"->":"kill3"},"\n",{"#f":5}],"c-1":[{"->":"hear4"},"\n",{"#f":5}]}],{"#f":1}],"hear4":[["^As you begin to critique his version of events, you notice that he has managed to slip an arm our of his restraints and is rubbing his stomach in a way that nauseates you to look at.","\n","^He is gaining immense pleasure from this oration.","\n","^'Okay I think we're done here.'","\n","^As you motion the guards to have his organs replaced without anaesthetic, the man's stomach begins to make a sound that scrapes at your sanity.","\n","ev","str","^Steel yourself","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"steel"},"\n",{"#f":5}]}],{"#f":1}],"steel":[["^The man's stomach explodes, launching viscera across the room and knocking over the guards.","\n","^As you try to make sense of the scene, some form of half-robotic but otherwise slimy creature, slithers its way towards you from a heap of ruptured flesh.","\n","^It hisses as it leaps towards you but a guard catches it midair and crushes it underfoot.","\n","ev","str","^Christ!","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":[{"->":"christ"},"\n",{"#f":5}]}],{"#f":1}],"christ":[["^We can't take the man's words at face value but this was more than one mad idiot's fitful symphony of despondency.","\n","^'Guards, thank you for saving my life but in future, please refrain from bringing deranged weaponised maniacs within 10 metres of me. You can consider your annual bonus lost at any rate.'","\n","ev","str","^Let's also start carrying a weapon. A letha one.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["end","\n",{"#f":5}]}],{"#f":1}],"getName":["ev","str","^The dreaded error method! What a truly horrifying name","/str","/ev","~ret",{"#f":1}],"global decl":["ev",false,{"VAR=":"vilmuth_happy"},false,{"VAR=":"vilmuth_neutral"},false,{"VAR=":"vilmuth_fear"},false,{"VAR=":"vilmuth_shock"},false,{"VAR=":"proceed"},"str","^testShipName","/str",{"VAR=":"shipName"},"str","^","/str",{"VAR=":"event_name"},"/ev","end",null],"#f":1}],"listDefs":{}}